FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/subsys/bluetooth/ble_trans.c
/*
 * Copyright (c) 2021 Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * SPDX-License-Identifier: Nordic-5-Clause
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "ble_trans.h"

#include <zephyr.h>
#include <errno.h>
#include <bluetooth/iso.h>
#include <bluetooth/bluetooth.h>
#include "macros_common.h"
#include "ctrl_events.h"
#include "ble_acl_common.h"
#include "sw_codec_select.h"
#include "ble_hci_vsc.h"
#include "ble_acl_gateway.h"

#include <logging/log.h>
LOG_MODULE_DECLARE(ble, CONFIG_LOG_BLE_LEVEL);

static iso_trans_type_t iso_trans_type;
static iso_direction_t iso_dir;

#define BLE_ISO_PAYLOAD_SIZE_MAX ENC_MAX_FRAME_SIZE

#define BLE_ISO_MTU		 (BT_ISO_CHAN_SEND_RESERVE + BLE_ISO_PAYLOAD_SIZE_MAX)
#define BLE_ISO_CONN_INTERVAL_US (BLE_ISO_CONN_INTERVAL * 1250)
#define BLE_ISO_LATENCY_MS	 10
#define BLE_ISO_RETRANSMITS	 2

#define CIS_ISO_CHAN_COUNT	 CONFIG_BT_ISO_MAX_CHAN
#define BIS_ISO_CHAN_COUNT	 1
#define BLE_ISO_BIG_SYNC_TIMEOUT 50

#define CIS_CONN_RETRY_TIMES	   5
#define HCI_ISO_BUF_ALLOC_PER_CHAN 2

#define NET_BUF_POOL_ITERATE(i, _) \
	NET_BUF_POOL_FIXED_DEFINE(iso_tx_pool_##i, HCI_ISO_BUF_ALLOC_PER_CHAN, \
				  BT_ISO_SDU_BUF_SIZE(CONFIG_BT_ISO_TX_MTU), 8, NULL);
#define NET_BUF_POOL_PTR_ITERATE(i, _) &iso_tx_pool_##i,

UTIL_LISTIFY(CONFIG_BT_ISO_MAX_CHAN, NET_BUF_POOL_ITERATE)

static struct net_buf_pool *iso_tx_pools[] = { UTIL_LISTIFY(CONFIG_BT_ISO_MAX_CHAN,
							    NET_BUF_POOL_PTR_ITERATE) };
static struct bt_iso_chan iso_chan[CONFIG_BT_ISO_MAX_CHAN];
static struct bt_iso_chan *iso_chan_p[CONFIG_BT_ISO_MAX_CHAN];
static atomic_t iso_tx_pool_alloc[CONFIG_BT_ISO_MAX_CHAN];

typedef struct {
	uint8_t channel;
	uint8_t retries;
} __aligned(4) work_data_t;

K_MSGQ_DEFINE(kwork_msgq, sizeof(work_data_t), CONFIG_BT_ISO_MAX_CHAN, 4);

static K_SEM_DEFINE(sem_big_cmplt, 0, 1);
static K_SEM_DEFINE(sem_big_term, 0, 1);
static K_SEM_DEFINE(sem_per_adv, 0, 1);
static K_SEM_DEFINE(sem_per_sync, 0, 1);
static K_SEM_DEFINE(sem_per_big_info, 0, 1);
static K_SEM_DEFINE(sem_big_sync, 0, 1);

static struct k_work_delayable iso_cis_conn_work;

#define BT_LE_SCAN_CUSTOM \
	BT_LE_SCAN_PARAM(BT_LE_SCAN_TYPE_PASSIVE, BT_LE_SCAN_OPT_NONE, BT_GAP_SCAN_FAST_INTERVAL, \
			 BT_GAP_SCAN_FAST_WINDOW)

#define BT_LE_PER_ADV_CUSTOM \
	BT_LE_PER_ADV_PARAM(BT_GAP_ADV_FAST_INT_MIN_2, BT_GAP_ADV_FAST_INT_MAX_2, \
			    BT_LE_PER_ADV_OPT_NONE)

/* Interval * 1.25 to get ms */
#define BT_INTERVAL_TO_MS(interval) ((interval)*5 / 4)
#define PA_RETRY_COUNT		    6

static bool per_adv_found;
static bt_addr_le_t per_addr;
static uint8_t per_sid;
static uint16_t per_interval_ms;

static struct bt_le_ext_adv *adv;
static struct bt_iso_big *big;
static struct bt_le_per_adv_sync_param sync_create_param;
static struct bt_le_per_adv_sync *iso_sync;
static struct bt_iso_big *big;
static uint32_t sem_timeout;
static uint32_t iso_rx_cb_tot;
static uint32_t iso_rx_cb_bad;

static ble_trans_iso_rx_cb_t ble_trans_iso_rx_cb;
static int iso_bis_rx_sync_delete(void);
static int iso_bis_rx_sync_get(void);
static void iso_rx_stats_handler(struct k_timer *timer);

static uint8_t iso_chan_to_idx(struct bt_iso_chan *chan)
{
	if (chan == NULL) {
		ERR_CHK_MSG(-EINVAL, "chan is NULL");
	}

	for (uint8_t i = 0; i < CONFIG_BT_ISO_MAX_CHAN; i++) {
		if (chan == iso_chan_p[i]) {
			return i;
		}
	}

	ERR_CHK_MSG(-ENXIO, "No index found for this channel");
	CODE_UNREACHABLE;
	return UINT8_MAX;
}

K_TIMER_DEFINE(iso_rx_stats_timer, iso_rx_stats_handler, NULL);

static int ble_event_send(ble_evt_type_t ble_evt)
{
	struct event_t event;

	event.event_source = EVT_SRC_PEER;
	event.link_activity = ble_evt;
	return ctrl_events_put(&event);
}

static void scan_recv(const struct bt_le_scan_recv_info *info, struct net_buf_simple *buf)
{
	int ret;

	if (!per_adv_found && info->interval) {
		per_adv_found = true;

		per_sid = info->sid;
		per_interval_ms = BT_INTERVAL_TO_MS(info->interval);
		bt_addr_le_copy(&per_addr, info->addr);

		LOG_INF("Stop scanning...");
		ret = bt_le_scan_stop();
		ERR_CHK_MSG(ret, "bt_le_scan_stop failed");

		ret = ble_event_send(BLE_EVT_CONNECTED);
		ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_CONNECTED in event queue");
		k_sem_give(&sem_per_adv);
	}
}

static struct bt_le_scan_cb scan_callbacks = {
	.recv = scan_recv,
};

