FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/subsys/bluetooth/ble_trans.c
static void sync_cb(struct bt_le_per_adv_sync *sync, struct bt_le_per_adv_sync_synced_info *info)
{
	k_sem_give(&sem_per_sync);
}

static void term_cb(struct bt_le_per_adv_sync *sync,
		    const struct bt_le_per_adv_sync_term_info *info)
{
	int ret;

	LOG_WRN("Lost sync");
	if (iso_dir == DIR_RX) {
		ret = iso_bis_rx_sync_delete();
		if (ret) {
			LOG_WRN("iso_bis_rx_sync_delete failed, ret = %d", ret);
		}
		ret = ble_event_send(BLE_EVT_DISCONNECTED);
		ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_DISCONNECTED in event queue");
	}
}

static void recv_cb(struct bt_le_per_adv_sync *sync,
		    const struct bt_le_per_adv_sync_recv_info *info, struct net_buf_simple *buf)
{
	/* Currently not in use */
}

static void biginfo_cb(struct bt_le_per_adv_sync *sync, const struct bt_iso_biginfo *biginfo)
{
	k_sem_give(&sem_per_big_info);
}

static struct bt_le_per_adv_sync_cb sync_callbacks = {
	.synced = sync_cb,
	.term = term_cb,
	.recv = recv_cb,
	.biginfo = biginfo_cb,
};

static uint8_t num_iso_cis_connected(void)
{
	uint8_t num_cis_connected = 0;

	for (int i = 0; i < CIS_ISO_CHAN_COUNT; i++) {
		if (iso_chan_p[i]->state == BT_ISO_CONNECTED) {
			num_cis_connected++;
		}
	}
	return num_cis_connected;
}

static void iso_rx_stats_handler(struct k_timer *timer)
{
	float bad_pcnt;

	if (iso_rx_cb_bad == 0) {
		bad_pcnt = 0;
	} else {
		bad_pcnt = 100 * (float)iso_rx_cb_bad / iso_rx_cb_tot;
	}
	LOG_WRN("BLE ISO RX. tot: %d bad %d, Percent %1.1f", iso_rx_cb_tot, iso_rx_cb_bad,
		bad_pcnt);

	iso_rx_cb_tot = 0;
	iso_rx_cb_bad = 0;
}

static void iso_rx_cb(struct bt_iso_chan *chan, const struct bt_iso_recv_info *info,
		      struct net_buf *buf)
{
	bool bad_frame = false;

	iso_rx_cb_tot++;

	if (ble_trans_iso_rx_cb == NULL) {
		ERR_CHK_MSG(-EPERM, "The RX callback has not been set");
	}

	if (info->flags != BT_ISO_FLAGS_VALID) {
		bad_frame = true;
		iso_rx_cb_bad++;
	}

	ble_trans_iso_rx_cb(buf->data, buf->len, bad_frame, info->ts);
}

static void iso_connected_cb(struct bt_iso_chan *chan)
{
	LOG_DBG("ISO Channel %p connected", chan);

	atomic_clear(&iso_tx_pool_alloc[iso_chan_to_idx(chan)]);

	if (iso_trans_type == TRANS_TYPE_BIS) {
		k_sem_give(&sem_big_sync);
		k_sem_give(&sem_big_cmplt);
	} else if (iso_trans_type == TRANS_TYPE_CIS) {
		int ret;

		/* Only send BLE event on first connected CIS */
		if (num_iso_cis_connected() == 1) {
			ret = ble_event_send(BLE_EVT_CONNECTED);
			ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_CONNECTED in event queue");

			ret = ble_event_send(BLE_EVT_LINK_READY);
			ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_LINK_READY in event queue");
		}
	} else {
		LOG_ERR("iso_trans_type error");
	}
}

static void iso_disconnected_cb(struct bt_iso_chan *chan, uint8_t reason)
{
	int ret;

	if (iso_trans_type == TRANS_TYPE_BIS) {
		k_sem_give(&sem_big_term);
		if (reason != BT_HCI_ERR_LOCALHOST_TERM_CONN) {
			LOG_DBG("Not cancelled by local host");
			if (iso_dir == DIR_RX) {
				ret = iso_bis_rx_sync_delete();
				if (ret) {
					LOG_DBG("iso_bis_rx_sync_delete failed, ret = %d", ret);
				}
				ret = ble_event_send(BLE_EVT_DISCONNECTED);
				ERR_CHK_MSG(
					ret,
					"Unable to put event BLE_EVT_DISCONNECTED in event queue");
			}
		}
	} else if (iso_trans_type == TRANS_TYPE_CIS) {
#if (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET)
		LOG_DBG("ISO CIS disconnected, reason %d", reason);
		ret = ble_event_send(BLE_EVT_DISCONNECTED);
		ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_DISCONNECTED in event queue");
#elif (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_GATEWAY)
		for (int i = 0; i < CIS_ISO_CHAN_COUNT; i++) {
			if (chan == iso_chan_p[i]) {
				LOG_DBG("ISO CIS %d disconnected, reason %d", i, reason);
				break;
			}
		}
		/* If there's no ISO CIS channel connected, trigger BLE_EVT_DISCONNECTED for stopping encoding thread */
		if (num_iso_cis_connected() == 0) {
			ret = ble_event_send(BLE_EVT_DISCONNECTED);
			ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_DISCONNECTED in event queue");
		}
#endif /* (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET) */
	} else {
		LOG_ERR("iso_trans_type not supported");
	}
}

/* Called when ISO TX is done and the buffer
 * has been freed
 */
static void iso_sent_cb(struct bt_iso_chan *chan)
{
	atomic_dec(&iso_tx_pool_alloc[iso_chan_to_idx(chan)]);
}

static struct bt_iso_chan_ops iso_ops = {
	.recv = iso_rx_cb,
	.connected = iso_connected_cb,
	.disconnected = iso_disconnected_cb,
	.sent = iso_sent_cb,
};

static struct bt_iso_chan_io_qos iso_tx_qos = {
	.sdu = BLE_ISO_PAYLOAD_SIZE_MAX, /* bytes */
	.rtn = BLE_ISO_RETRANSMITS,
	.phy = BT_GAP_LE_PHY_2M,
};

static struct bt_iso_chan_io_qos iso_rx_qos;
static struct bt_iso_chan_qos iso_bis_qos;

static struct bt_iso_big_create_param big_create_param = {
	.num_bis = BIS_ISO_CHAN_COUNT,
	.bis_channels = iso_chan_p,
	.interval = BLE_ISO_CONN_INTERVAL_US, /* in microseconds */
	.latency = BLE_ISO_LATENCY_MS, /* milliseconds */
	.packing = BT_ISO_PACKING_SEQUENTIAL,
	.framing = BT_ISO_FRAMING_UNFRAMED,
};

static struct bt_iso_big_sync_param big_sync_param = {
	.num_bis = BIS_ISO_CHAN_COUNT,
	.bis_channels = iso_chan_p,
	.bis_bitfield = (BIT_MASK(BIS_ISO_CHAN_COUNT) << 1),
	.mse = BT_ISO_SYNC_MSE_MIN,
	.sync_timeout = BLE_ISO_BIG_SYNC_TIMEOUT,
};

static struct bt_iso_chan_qos iso_cis_qos;

static struct bt_iso_cig_param cis_create_param = {
	.cis_channels = iso_chan_p,
	.num_cis = CIS_ISO_CHAN_COUNT,
	.sca = BT_GAP_SCA_UNKNOWN,
	.packing = BT_ISO_PACKING_SEQUENTIAL,
	.framing = BT_ISO_FRAMING_UNFRAMED,
	.latency = BLE_ISO_LATENCY_MS,
	.interval = BLE_ISO_CONN_INTERVAL_US,
};

static int iso_bis_rx_sync_delete(void)
{
	int ret;

	per_adv_found = false;

	if (iso_sync == NULL) {
		LOG_DBG("Already deleted iso_sync");
	}

	LOG_DBG("Deleting Periodic Advertising Sync...");

	ret = bt_le_per_adv_sync_delete(iso_sync);
	if (ret) {
		LOG_ERR("bt_le_per_adv_sync_delete failed: %d", ret);
	}

	iso_sync = NULL;

	return ret;
}

static int iso_bis_rx_sync_get(void)
{
	int ret;

	if (iso_sync != NULL) {
		LOG_DBG("Already have sync, returning");
		return 0;
	}

	per_adv_found = false;
	LOG_DBG("Start scanning...");
	ret = bt_le_scan_start(BT_LE_SCAN_CUSTOM, NULL);
	RET_IF_ERR_MSG(ret, "ble_le_scan_start failed");

