FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/subsys/bluetooth/ble_trans.c
	LOG_DBG("Waiting for periodic advertising...");

	ret = k_sem_take(&sem_per_adv, K_FOREVER);
	RET_IF_ERR_MSG(ret, "k_sem_take failed");

	LOG_DBG("Creating Periodic Advertising Sync...");
	bt_addr_le_copy(&sync_create_param.addr, &per_addr);
	sync_create_param.options = 0;
	sync_create_param.sid = per_sid;
	sync_create_param.skip = 0;
	sync_create_param.timeout = (per_interval_ms * PA_RETRY_COUNT) / 10;
	sem_timeout = per_interval_ms * PA_RETRY_COUNT;
	ret = bt_le_per_adv_sync_create(&sync_create_param, &iso_sync);
	RET_IF_ERR_MSG(ret, "bt_le_per_adv_sync_create failed");

	LOG_DBG("Waiting for periodic sync");
	k_sem_reset(&sem_per_sync);
	ret = k_sem_take(&sem_per_sync, K_MSEC(sem_timeout));
	RET_IF_ERR_MSG(ret, "sem_per_sync failed");

	LOG_DBG("Periodic sync established");
	k_sem_reset(&sem_per_big_info);
	ret = k_sem_take(&sem_per_big_info, K_MSEC(sem_timeout));
	RET_IF_ERR_MSG(ret, "sem_per_big_info failed");

	ret = ble_event_send(BLE_EVT_LINK_READY);
	ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_LINK_READY in event queue");

	return 0;
}

static int iso_bis_rx_init(void)
{
	int ret;

	bt_le_scan_cb_register(&scan_callbacks);
	bt_le_per_adv_sync_cb_register(&sync_callbacks);

	ret = iso_bis_rx_sync_get();
	RET_IF_ERR_MSG(ret, "Sync lost before enter streaming state");

	return 0;
}

static void iso_bis_rx_cleanup(void)
{
	int ret;

	ret = iso_bis_rx_sync_delete();
	if (ret) {
		LOG_WRN("Failed to clean sync, ret = %d", ret);
	}

	ret = bt_iso_big_terminate(big);
	if (ret) {
		LOG_WRN("Failed to terminate BIG, ret = %d", ret);
	} else {
		big = NULL;
	}
}

static int iso_bis_rx_start(void)
{
	int ret;

	ret = iso_bis_rx_sync_get();
	if (ret) {
		LOG_WRN("iso_bis_rx_sync_get failed");
		iso_bis_rx_sync_delete();
		return ret;
	}

	LOG_DBG("Trying to get sync...");
	/* Set the BIS we want to sync to */

	ret = bt_iso_big_sync(iso_sync, &big_sync_param, &big);
	if (ret) {
		LOG_ERR("bt_iso_big_sync failed");
		iso_bis_rx_cleanup();
		return ret;
	}

	ret = k_sem_take(&sem_big_sync, K_MSEC(sem_timeout));
	if (ret) {
		LOG_ERR("k_sem_take sem_big_sync failed");
		iso_bis_rx_cleanup();
		return ret;
	}

	LOG_DBG("bt_iso_big_sync established");

	ret = ble_event_send(BLE_EVT_STREAMING);
	ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_STREAMING in event queue");

	return 0;
}

static int iso_bis_rx_stop(void)
{
	int ret;

	ret = bt_iso_big_terminate(big);
	RET_IF_ERR(ret);

	LOG_DBG("Waiting for BIG terminate complete...");
	ret = k_sem_take(&sem_big_term, K_FOREVER);
	RET_IF_ERR(ret);
	LOG_DBG("BIG terminate completed");

	return 0;
}

static int iso_bis_tx_init(void)
{
	int ret;

	/* Create a non-connectable non-scannable advertising set */
	ret = bt_le_ext_adv_create(BT_LE_EXT_ADV_NCONN_NAME, NULL, &adv);
	RET_IF_ERR_MSG(ret, "Failed to create advertising set");

	return 0;
}

static int iso_bis_tx_start(void)
{
	int ret;

	/* Set periodic advertising parameters */
	ret = bt_le_per_adv_set_param(adv, BT_LE_PER_ADV_CUSTOM);
	RET_IF_ERR_MSG(ret, "Failed to set periodic advertising parameters");

	/* Enable Periodic Advertising */
	ret = bt_le_per_adv_start(adv);
	RET_IF_ERR_MSG(ret, "Failed to enable periodic advertising");

	/* Start extended advertising */
	ret = bt_le_ext_adv_start(adv, BT_LE_EXT_ADV_START_DEFAULT);
	RET_IF_ERR_MSG(ret, "Failed to start extended advertising");

	ret = ble_event_send(BLE_EVT_CONNECTED);
	ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_CONNECTED in event queue");

	/* Create BIG */
	ret = bt_iso_big_create(adv, &big_create_param, &big);
	RET_IF_ERR_MSG(ret, "Failed to create BIG");

	LOG_DBG("Waiting for BIG complete");
	ret = k_sem_take(&sem_big_cmplt, K_FOREVER);
	RET_IF_ERR(ret);

	ret = ble_event_send(BLE_EVT_LINK_READY);
	ERR_CHK_MSG(ret, "Unable to put event BLE_EVT_LINK_READY in event queue");

	LOG_DBG("ISO Create done");

	return 0;
}

static int iso_bis_tx_stop(void)
{
	int ret;

	ret = bt_iso_big_terminate(big);
	RET_IF_ERR(ret);

	LOG_DBG("Waiting for BIG terminate complete...");
	ret = k_sem_take(&sem_big_term, K_MSEC(sem_timeout));
	if (ret == -EAGAIN) {
		LOG_WRN("sem_big_term timeout");
		return ret;
	}

	LOG_DBG("Stop advertising");
	ret = bt_le_ext_adv_stop(adv);
	RET_IF_ERR(ret);

	LOG_DBG("Disable periodic advertising");
	ret = bt_le_per_adv_stop(adv);
	RET_IF_ERR(ret);

	return 0;
}

static int iso_bis_start(iso_direction_t dir)
{
	switch (dir) {
	case DIR_RX:
		return iso_bis_rx_start();
	case DIR_TX:
		return iso_bis_tx_start();
	default:
		LOG_WRN("Invalid direction supplied: %d", dir);
		return -EPERM;
	};
}

static void work_iso_cis_conn(struct k_work *work)
{
	int ret;
	struct bt_iso_connect_param connect_param;
	work_data_t work_data;

	ret = k_msgq_get(&kwork_msgq, &work_data, K_NO_WAIT);
	ERR_CHK(ret);

	ret = ble_acl_gateway_conn_peer_get(work_data.channel, &connect_param.acl);
	ERR_CHK_MSG(ret, "Connection peer get error");
	connect_param.iso_chan = iso_chan_p[work_data.channel];

	ret = bt_iso_chan_connect(&connect_param, 1);
	work_data.retries++;
	if (ret) {
		if (work_data.retries < CIS_CONN_RETRY_TIMES) {
			LOG_WRN("Got connect error from ch %d Retrying. code: %d count: %d",
				work_data.channel, ret, work_data.retries);
			ret = k_msgq_put(&kwork_msgq, &work_data, K_NO_WAIT);
			ERR_CHK(ret);
			/* Delay added to prevent controller overloading */
			k_work_reschedule(&iso_cis_conn_work, K_MSEC(500));
		} else {
			LOG_ERR("Could not connect ch %d after %d retries", work_data.channel,
				work_data.retries);
			bt_conn_disconnect(connect_param.acl, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
		}
	}
}

#if (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET) && (CONFIG_TRANSPORT_CIS)
static int iso_accept(const struct bt_iso_accept_info *info, struct bt_iso_chan **chan)
{
	/* Since a CIS headset only will connect to one other device, the
	 * first channel will always be used
	 */
	if (iso_chan_p[0]->iso) {
		LOG_ERR("No channels available\n");
		return -ENOMEM;
	}
	*chan = iso_chan_p[0];
	return 0;
}

static struct bt_iso_server iso_server = {
	.sec_level = BT_SECURITY_L0,
	.accept = iso_accept,
};
#endif /* (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET) && (CONFIG_TRANSPORT_CIS) */

static bool is_iso_buffer_full(uint8_t iso_chan_idx)
{
	/* net_buf_alloc allocates buffers for APP->NET transfer over HCI RPMsg.
	 * The iso_sent_cb is called when a buffer/buffers have been released,
	 * i.e. data transfer to the NET core has been completed.
	 * Data will be discarded if allocation becomes too high.
	 * If the NET and APP core operates in clock sync, discarding should not occur.
	 */

	if (atomic_get(&iso_tx_pool_alloc[iso_chan_idx]) >= HCI_ISO_BUF_ALLOC_PER_CHAN) {
		return true;
	}
	return false;
}

static int iso_tx(uint8_t const *const data, size_t size, uint8_t iso_chan_idx)
{
	int ret;
	static bool wrn_printed[CONFIG_BT_ISO_MAX_CHAN];
	struct net_buf *net_buffer;

	if (is_iso_buffer_full(iso_chan_idx)) {
		if (!wrn_printed[iso_chan_idx]) {
			LOG_WRN("HCI ISO TX overrun on ch %d. Single print", iso_chan_idx);
			wrn_printed[iso_chan_idx] = true;
		}
		return -ENOMEM;
	}

	wrn_printed[iso_chan_idx] = false;

	net_buffer = net_buf_alloc(iso_tx_pools[iso_chan_idx], K_NO_WAIT);
	if (net_buffer == NULL) {
		LOG_ERR("No net buf available");
		return -ENOMEM;
	}

	atomic_inc(&iso_tx_pool_alloc[iso_chan_idx]);
	/* Headroom reserved for stack use */
	net_buf_reserve(net_buffer, BT_ISO_CHAN_SEND_RESERVE);
	net_buf_add_mem(net_buffer, data, size);

	ret = bt_iso_chan_send(iso_chan_p[iso_chan_idx], net_buffer);
	if (ret < 0) {
		LOG_ERR("Unable to send ISO data: %d", ret);
		net_buf_unref(net_buffer);
		return ret;
	}
	return 0;
}

static int iso_tx_pattern(size_t size, uint8_t iso_chan_idx)
{
	int ret;
	static uint8_t test_pattern_data[CONFIG_BT_ISO_MAX_CHAN][ENC_MAX_FRAME_SIZE];
	static uint8_t test_pattern_value[CONFIG_BT_ISO_MAX_CHAN];

	if (iso_chan_idx >= CONFIG_BT_ISO_MAX_CHAN) {
		RET_IF_ERR_MSG(-EIO, "Unknown channel");
	}

