FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/subsys/bluetooth/ble_trans.c
	memset(test_pattern_data[iso_chan_idx], test_pattern_value[iso_chan_idx],
	       ENC_MAX_FRAME_SIZE);
	ret = iso_tx(test_pattern_data[iso_chan_idx], size, iso_chan_idx);

	if (ret == 0) {
		if (test_pattern_value[iso_chan_idx] == UINT8_MAX) {
			test_pattern_value[iso_chan_idx] = 0;
		} else {
			test_pattern_value[iso_chan_idx]++;
		}
	}

	return ret;
}

static int iso_tx_data_or_pattern(uint8_t const *const data, size_t size, uint8_t iso_chan_idx)
{
	int ret;

	if (iso_chan_p[iso_chan_idx]->state != BT_ISO_CONNECTED) {
		LOG_DBG("ISO channel %d not connected", iso_chan_idx);
		return 0;
	}

	if (IS_ENABLED(CONFIG_BLE_ISO_TEST_PATTERN)) {
		ret = iso_tx_pattern(size, iso_chan_idx);
	} else {
		ret = iso_tx(data, size, iso_chan_idx);
	}

	return ret;
}

int ble_trans_iso_lost_notify_enable(void)
{
	return ble_hci_vsc_set_op_flag(BLE_HCI_VSC_OP_ISO_LOST_NOTIFY, 1);
}

int ble_trans_iso_tx(uint8_t const *const data, size_t size, ble_trans_chan_type_t chan_type)
{
	int ret = 0;

	/* BIS defaults to channel 0 */
	if (iso_trans_type == TRANS_TYPE_BIS) {
		ret = iso_tx_data_or_pattern(data, size, BLE_TRANS_CHANNEL_LEFT);
		RET_IF_ERR(ret);
		return 0;
	}

	switch (chan_type) {
	case BLE_TRANS_CHANNEL_STEREO:
		ret = iso_tx_data_or_pattern(data, size / 2, BLE_TRANS_CHANNEL_LEFT);
		RET_IF_ERR(ret);
		ret = iso_tx_data_or_pattern(&data[size / 2], size / 2, BLE_TRANS_CHANNEL_RIGHT);
		RET_IF_ERR(ret);
		break;
	case BLE_TRANS_CHANNEL_RETURN_MONO:
		ret = iso_tx_data_or_pattern(data, size, BLE_TRANS_CHANNEL_RETURN_MONO);
		RET_IF_ERR(ret);
		break;
	default:
		return -EPERM;
	}

	return ret;
}

int ble_trans_iso_start(void)
{
	switch (iso_trans_type) {
	case TRANS_TYPE_NOT_SET:
		LOG_ERR("Transport type not set");
		return -EPERM;
	case TRANS_TYPE_BIS:
		return iso_bis_start(iso_dir);
	case TRANS_TYPE_CIS:
		/* The ISO CIS channel established automatically
		 * after ACL connected, so ISO CIS is ready for use.
		 * And once ISO CIS channel established,
		 * we maintain it unless ACL disconnected for now.
		 */
		return 0;
	default:
		return -EPERM;
	};

	return 0;
}

int ble_trans_iso_stop(void)
{
	if (iso_trans_type == TRANS_TYPE_BIS) {
		switch (iso_dir) {
		case DIR_RX:
			return iso_bis_rx_stop();
		case DIR_TX:
			return iso_bis_tx_stop();
		default:
			return -EPERM;
		};
	} else if (iso_trans_type == TRANS_TYPE_CIS) {
		return 0;
	} else {
		return -EPERM;
	}
}

int ble_trans_iso_cig_create(void)
{
	int ret;

	struct bt_iso_cig *cig;

	ret = bt_iso_cig_create(&cis_create_param, &cig);
	if (ret) {
		LOG_ERR("Failed to create CIG (%d)\n", ret);
		return ret;
	}

	return 0;
}

int ble_trans_iso_cis_connect(struct bt_conn *conn)
{
	int ret;
	struct bt_conn *conn_active;

	for (uint8_t i = 0; i < CONFIG_BT_MAX_CONN; i++) {
		ret = ble_acl_gateway_conn_peer_get(i, &conn_active);
		ERR_CHK_MSG(ret, "Connection peer get error");
		if (conn == conn_active) {
			work_data_t work_data;

			work_data.channel = i;
			work_data.retries = 0;
			ret = k_msgq_put(&kwork_msgq, &work_data, K_NO_WAIT);
			RET_IF_ERR(ret);
			k_work_schedule(&iso_cis_conn_work, K_MSEC(500 * i));
		}
	}

	return 0;
}

int ble_trans_iso_bis_rx_sync_get(void)
{
	return iso_bis_rx_sync_get();
}

int ble_trans_iso_init(iso_trans_type_t trans_type, iso_direction_t dir,
		       ble_trans_iso_rx_cb_t rx_cb)
{
	int ret;

	if (iso_dir != DIR_NOT_SET) {
		return -EINVAL;
	}

	iso_dir = dir;

	if (iso_trans_type != TRANS_TYPE_NOT_SET) {
		return -EPERM;
	}

	for (int8_t i = 0; i < CONFIG_BT_ISO_MAX_CHAN; i++) {
		iso_chan_p[i] = &iso_chan[i];
	}

	iso_trans_type = trans_type;

	switch (iso_trans_type) {
	case TRANS_TYPE_NOT_SET:
		LOG_ERR("NOT SET");
		return -EPERM;
	case TRANS_TYPE_BIS:
		switch (iso_dir) {
		case DIR_RX:
			iso_bis_qos.rx = &iso_rx_qos;
			iso_bis_qos.tx = NULL;
			ret = iso_bis_rx_init();
			RET_IF_ERR(ret);
			break;
		case DIR_TX:
			iso_bis_qos.rx = NULL;
			iso_bis_qos.tx = &iso_tx_qos;
			ret = iso_bis_tx_init();
			RET_IF_ERR(ret);
			break;
		default:
			return -EPERM;
		};

		iso_chan_p[0]->ops = &iso_ops;
		iso_chan_p[0]->qos = &iso_bis_qos;
		break;
	case TRANS_TYPE_CIS:
		k_work_init_delayable(&iso_cis_conn_work, work_iso_cis_conn);

		for (int i = 0; i < CIS_ISO_CHAN_COUNT; i++) {
			iso_chan_p[i]->ops = &iso_ops;
			iso_chan_p[i]->qos = &iso_cis_qos;
		}
		switch (iso_dir) {
		case DIR_RX:
			/* Use the same setting between TX and RX */
			memcpy(&iso_rx_qos, &iso_tx_qos, sizeof(iso_tx_qos));
			iso_cis_qos.rx = &iso_rx_qos;
			iso_cis_qos.tx = NULL;
			break;
		case DIR_TX:
			iso_cis_qos.rx = NULL;
			iso_cis_qos.tx = &iso_tx_qos;
			break;
		case DIR_BIDIR:
			/* Use the same setting between TX and RX */
			memcpy(&iso_rx_qos, &iso_tx_qos, sizeof(iso_tx_qos));
			iso_cis_qos.rx = &iso_rx_qos;
			iso_cis_qos.tx = &iso_tx_qos;
			break;
		default:
			return -EPERM;
		};
		break;
	default:
		return -EPERM;
	};
	ble_trans_iso_rx_cb = rx_cb;

#if (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET) && (CONFIG_TRANSPORT_CIS)
	ret = bt_iso_server_register(&iso_server);
	RET_IF_ERR_MSG(ret, "Unable to register ISO server");
#endif /* (NRF5340_AUDIO_DEV == NRF5340_AUDIO_DEV_HEADSET) && (CONFIG_TRANSPORT_CIS) */

	if (CONFIG_BLE_ISO_RX_STATS_S != 0) {
		k_timer_start(&iso_rx_stats_timer, K_SECONDS(0),
			      K_SECONDS(CONFIG_BLE_ISO_RX_STATS_S));
	}

	LOG_DBG("Init finished");
	return 0;
}
